import { APP_CONFIG } from './app'

export const SEO = {
	name: 'Encod',

	description:
		'Encod — українська IT-платформа для навчання, яка допомагає жiвчiкам і фахівцям опановувати розробку програмного забезпечення, вебтехнології, програмування, UI/UX-дизайн та сучасні цифрові навички через практичне навчання.',

	url: APP_CONFIG.baseUrl,

	keywords: [
		'Encod',
		'IT-платформа для навчання',
		'онлайн IT-курси',
		'курси програмування',
		'навчання розробці програмного забезпечення',
		'курси веброзробки',
		'Frontend розробка',
		'Backend розробка',
		'Full Stack розробка',
		'курс React',
		'курс Next.js',
		'курс TypeScript',
		'курс JavaScript',
		'UI UX дизайн',
		'IT-освіта',
		'навчання програмуванню',
		'IT-академія',
		'IT-освіта в Україні',
		'вивчення програмування',
		'карʼєра в IT',
		'онлайн-навчання',
		'цифрові навички',
		'розробка програмного забезпечення',
		'курси IT в Україні'
	],

	formatDetection: {
		email: false,
		address: false,
		telephone: false
	}
}